{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspaceLocation": {
            "type": "string"
        },
        "workspaceResourceId": {
            "type": "string"
        },
        "actionGroupId": {
            "type": "string"
        },
        "customerId": {
            "type": "string"
        }
    },
    "variables": {
        "hiddenLinkTag": "[json( concat( '{\"hidden-link:', parameters('workspaceResourceId'), '\": \"Resource\"}' ) )]",
        "alertCopy": {
            "warnAlertDetails": [
               {
                    "alertName": "10m-security-kernel-module-load",
                    "alertDescription": "Loading and Unloading Kernel Modules. v1",
                    "query": "LinuxAuditLog | where key == 'kernelmodules' and RecordType != 'CONFIG_CHANGE'",
                    "frequencyInMinutes": 15,
                    "timeWindowInMinutes": 15,
                    "emailSubject": "[concat(parameters('customerId'),'-Kernel-Module-Load')]",
                    "thresholdOperator": "GreaterThan",
                    "threshold": 0,
                    "severity": 4
                },
                {
                    "alertName": "10m-security-suspicious-executed-commands",
                    "alertDescription": "Distinct Paths of Executed Commands. v1",
                    "query": "LinuxAuditLog | where RecordType == 'syscall' and syscall == 'execve' | summarize count() by exe",
                    "frequencyInMinutes": 15,
                    "timeWindowInMinutes": 15,
                    "emailSubject": "[concat(parameters('customerId'),'-Suspicious-Executed-Commands')]",
                    "thresholdOperator": "GreaterThan",
                    "threshold": 0,
                    "severity": 4
                },
                {
                    "alertName": "10m-security-failed-logon-attempts-linux",
                    "alertDescription": "Linux Systems with Failed Logons. v1",
                    "query": "LinuxAuditLog | where RecordType == 'user_login' and res != 'success' | summarize count() by acct",
                    "frequencyInMinutes": 15,
                    "timeWindowInMinutes": 15,
                    "emailSubject": "[concat(parameters('customerId'),'-Linux-Failed-Logon-Attempts')]",
                    "thresholdOperator": "GreaterThan",
                    "threshold": 0,
                    "severity": 4
                },
                {
                    "alertName": "10m-security-linux-executed-commands",
                    "alertDescription": "Linux Commands Executed. v1",
                    "query": "LinuxAuditLog | where RecordType == 'syscall' and syscall == 'execve' | summarize count() by cmd",
                    "frequencyInMinutes": 15,
                    "timeWindowInMinutes": 15,
                    "emailSubject": "[concat(parameters('customerId'),'-Linux-Executed-Commands')]",
                    "thresholdOperator": "GreaterThan",
                    "threshold": 0,
                    "severity": 4
                },
                {
                    "alertName": "10m-security-linux-group-changes",
                    "alertDescription": "Computers with Users Added to a Linux Group. v1",
                    "query": "Syslog | where Facility == 'authpriv' and SyslogMessage has 'to group' and (SyslogMessage has 'add' or SyslogMessage has 'added') | summarize by Computer",
                    "frequencyInMinutes": 15,
                    "timeWindowInMinutes": 15,
                    "emailSubject": "[concat(parameters('customerId'),'-Linux-Group-Changes')]",
                    "thresholdOperator": "GreaterThan",
                    "threshold": 0,
                    "severity": 4
                },
                {
                    "alertName": "10m-security-linux-group-created",
                    "alertDescription": "Computers with a Linux Group Created. v1",
                    "query": "Syslog | where Facility == 'authpriv' and SyslogMessage has 'new group' | summarize count() by Computer",
                    "frequencyInMinutes": 15,
                    "timeWindowInMinutes": 15,
                    "emailSubject": "[concat(parameters('customerId'),'-linux-group-created')]",
                    "thresholdOperator": "GreaterThan",
                    "threshold": 0,
                    "severity": 4
                },
                {
                    "alertName": "10m-security-linux-failed-password-changes",
                    "alertDescription": "Computers with Failed Linux User Password Changes. v1",
                    "query": "Syslog | where Facility == 'authpriv' and ((SyslogMessage has 'passwd:chauthtok' and SyslogMessage has 'authentication failure') or SyslogMessage has 'password change failed') | summarize count() by Computer",
                    "frequencyInMinutes": 15,
                    "timeWindowInMinutes": 15,
                    "emailSubject": "[concat(parameters('customerId'),'-Linux-Failed-Password-Change')]",
                    "thresholdOperator": "GreaterThan",
                    "threshold": 0,
                    "severity": 4
                },
                {
                    "alertName": "10m-security-failed-ssh-logons",
                    "alertDescription": "Computers with Failed SSH Logons. v1",
                    "query": "Syslog | where (Facility == 'authpriv' and SyslogMessage has 'sshd:auth' and SyslogMessage has 'authentication failure') or (Facility == 'auth' and ((SyslogMessage has 'Failed' and SyslogMessage has 'invalid user' and SyslogMessage has 'ssh2') or SyslogMessage has 'error: PAM: Authentication failure')) | summarize count() by Computer",
                    "frequencyInMinutes": 15,
                    "timeWindowInMinutes": 15,
                    "emailSubject": "[concat(parameters('customerId'),'-Failed-SSH-Logons')]",
                    "thresholdOperator": "GreaterThan",
                    "threshold": 0,
                    "severity": 4
                },
                {
                    "alertName": "10m-security-failed-su-logons",
                    "alertDescription": "Computers with Failed SU Logons. v1",
                    "query": "Syslog | where (Facility == 'authpriv' and SyslogMessage has 'su:auth' and SyslogMessage has 'authentication failure') or (Facility == 'auth' and SyslogMessage has 'FAILED SU') | summarize count() by Computer",
                    "frequencyInMinutes": 15,
                    "timeWindowInMinutes": 15,
                    "emailSubject": "[concat(parameters('customerId'),'-Failed-SU-Logons')]",
                    "thresholdOperator": "GreaterThan",
                    "threshold": 0,
                    "severity": 4
                },
                {
                    "alertName": "10m-security-failed-sudo-logons",
                    "alertDescription": "Computers with Failed SUDO Logons. v1",
                    "query": "Syslog | where (Facility == 'authpriv' and SyslogMessage has 'sudo:auth' and (SyslogMessage has 'authentication failure' or SyslogMessage has 'conversation failed')) or ((Facility == 'auth' or Facility == 'authpriv') and SyslogMessage has 'user NOT in sudoers') | summarize count() by Computer",
                    "frequencyInMinutes": 15,
                    "timeWindowInMinutes": 15,
                    "emailSubject": "[concat(parameters('customerId'),'-Failed-SUDO-Logons')]",
                    "thresholdOperator": "GreaterThan",
                    "threshold": 0,
                    "severity": 4
                },
                {
                    "alertName": "10m-security-abnormally-high-deletes",
                    "alertDescription": "Delete Count by User and Operation. v1",
                    "query": "AzureActivity | where OperationName contains '/delete' and OperationName !contains 'snapshots' | summarize Deletes = count(Caller) by OperationName, Caller",
                    "frequencyInMinutes": 15,
                    "timeWindowInMinutes": 15,
                    "emailSubject": "[concat(parameters('customerId'),'-Abnormally-High-Deletes')]",
                    "thresholdOperator": "GreaterThan",
                    "threshold": 100,
                    "severity": 4
                }
            ]
        }
    },
    "resources": [
        {
            "type": "Microsoft.Insights/scheduledQueryRules",
            "name": "[variables('alertCopy').warnAlertDetails[copyIndex()].alertName]",
            "apiVersion": "2018-04-16",
            "location": "[parameters( 'workspaceLocation' )]",
            "tags": "[variables('hiddenLinkTag')]",
            "copy": {
                "count": "[length(variables('alertCopy').warnAlertDetails)]",
                "name": "alertCopy"
            },
            "properties": {
                "description": "[variables('alertCopy').warnAlertDetails[copyIndex()].alertDescription]",
                "enabled": "true",
                "source": {
                    "query": "[variables('alertCopy').warnAlertDetails[copyIndex()].query]",
                    "dataSourceId": "[parameters('workspaceResourceId')]",
                    "queryType": "ResultCount"
                },
                "schedule": {
                    "frequencyInMinutes": "[variables('alertCopy').warnAlertDetails[copyIndex()].frequencyInMinutes]",
                    "timeWindowInMinutes": "[variables('alertCopy').warnAlertDetails[copyIndex()].timeWindowInMinutes]"
                },
                "action": {
                    "odata.type": "Microsoft.WindowsAzure.Management.Monitoring.Alerts.Models.Microsoft.AppInsights.Nexus.DataContracts.Resources.ScheduledQueryRules.AlertingAction",
                    "severity": "[variables('alertCopy').warnAlertDetails[copyIndex()].severity]",
                    "throttlingInMin": 1440,
                    "aznsAction": {
                        "actionGroup": [
                            "[parameters('actionGroupId')]"
                        ],
                        "emailSubject": "[variables('alertCopy').warnAlertDetails[copyIndex()].emailSubject]"
                    },
                    "trigger": {
                        "thresholdOperator": "[variables('alertCopy').warnAlertDetails[copyIndex()].thresholdOperator]",
                        "threshold": "[variables('alertCopy').warnAlertDetails[copyIndex()].threshold]"
                    }
                }
            }
        }
    ]
}